stm32duino/LSM6DSO16IS/src/lsm6dso16is_reg.h
int32_t lsm6dso16is_read_reg(lsm6dso16is_ctx_t *ctx, uint8_t reg,
                             uint8_t *data,
                             uint16_t len);
int32_t lsm6dso16is_write_reg(lsm6dso16is_ctx_t *ctx, uint8_t reg,
                              uint8_t *data,
                              uint16_t len);

float_t lsm6dso16is_from_fs2g_to_mg(int16_t lsb);
float_t lsm6dso16is_from_fs4g_to_mg(int16_t lsb);
float_t lsm6dso16is_from_fs8g_to_mg(int16_t lsb);
float_t lsm6dso16is_from_fs16g_to_mg(int16_t lsb);

float_t lsm6dso16is_from_fs125dps_to_mdps(int16_t lsb);
float_t lsm6dso16is_from_fs250dps_to_mdps(int16_t lsb);
float_t lsm6dso16is_from_fs500dps_to_mdps(int16_t lsb);
float_t lsm6dso16is_from_fs1000dps_to_mdps(int16_t lsb);
float_t lsm6dso16is_from_fs2000dps_to_mdps(int16_t lsb);

float_t lsm6dso16is_from_lsb_to_celsius(int16_t lsb);

typedef enum {
  LSM6DSO16IS_MAIN_MEM_BANK =             0x0,
  LSM6DSO16IS_SENSOR_HUB_MEM_BANK =       0x2,
  LSM6DSO16IS_ISPU_MEM_BANK =             0x3,
} lsm6dso16is_mem_bank_t;
int32_t lsm6dso16is_mem_bank_set(lsm6dso16is_ctx_t *ctx, lsm6dso16is_mem_bank_t val);
int32_t lsm6dso16is_mem_bank_get(lsm6dso16is_ctx_t *ctx,
                                 lsm6dso16is_mem_bank_t *val);

typedef enum {
  LSM6DSO16IS_DRDY_LATCHED =              0x0,
  LSM6DSO16IS_DRDY_PULSED =               0x1,
} lsm6dso16is_data_ready_mode_t;
int32_t lsm6dso16is_data_ready_mode_set(lsm6dso16is_ctx_t *ctx,
                                        lsm6dso16is_data_ready_mode_t val);
int32_t lsm6dso16is_data_ready_mode_get(lsm6dso16is_ctx_t *ctx,
                                        lsm6dso16is_data_ready_mode_t *val);

int32_t lsm6dso16is_device_id_set(lsm6dso16is_ctx_t *ctx, uint8_t val);
int32_t lsm6dso16is_device_id_get(lsm6dso16is_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso16is_reset_set(lsm6dso16is_ctx_t *ctx, uint8_t val);
int32_t lsm6dso16is_reset_get(lsm6dso16is_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso16is_boot_set(lsm6dso16is_ctx_t *ctx, uint8_t val);
int32_t lsm6dso16is_boot_get(lsm6dso16is_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSO16IS_HIGH_PERFOMANCE_MODE_ENABLED =        0x0,
  LSM6DSO16IS_HIGH_PERFOMANCE_MODE_DISABLED =       0x1,
} lsm6dso16is_hm_mode_t;
int32_t lsm6dso16is_xl_hm_mode_set(lsm6dso16is_ctx_t *ctx,
                                   lsm6dso16is_hm_mode_t val);
int32_t lsm6dso16is_xl_hm_mode_get(lsm6dso16is_ctx_t *ctx,
                                   lsm6dso16is_hm_mode_t *val);
int32_t lsm6dso16is_gy_hm_mode_set(lsm6dso16is_ctx_t *ctx,
                                   lsm6dso16is_hm_mode_t val);
int32_t lsm6dso16is_gy_hm_mode_get(lsm6dso16is_ctx_t *ctx,
                                   lsm6dso16is_hm_mode_t *val);

typedef enum {
  LSM6DSO16IS_2g =                        0x0,
  LSM6DSO16IS_16g =                       0x1,
  LSM6DSO16IS_4g =                        0x2,
  LSM6DSO16IS_8g =                        0x3,
} lsm6dso16is_xl_full_scale_t;
int32_t lsm6dso16is_xl_full_scale_set(lsm6dso16is_ctx_t *ctx,
                                      lsm6dso16is_xl_full_scale_t val);
int32_t lsm6dso16is_xl_full_scale_get(lsm6dso16is_ctx_t *ctx,
                                      lsm6dso16is_xl_full_scale_t *val);

typedef enum {
  LSM6DSO16IS_XL_ODR_OFF =                0x0,
  LSM6DSO16IS_XL_ODR_AT_12Hz5_HP =        0x1,
  LSM6DSO16IS_XL_ODR_AT_26H_HP =          0x2,
  LSM6DSO16IS_XL_ODR_AT_52Hz_HP =         0x3,
  LSM6DSO16IS_XL_ODR_AT_104Hz_HP =        0x4,
  LSM6DSO16IS_XL_ODR_AT_208Hz_HP =        0x5,
  LSM6DSO16IS_XL_ODR_AT_416Hz_HP =        0x6,
  LSM6DSO16IS_XL_ODR_AT_833Hz_HP =        0x7,
  LSM6DSO16IS_XL_ODR_AT_1667Hz_HP =       0x8,
  LSM6DSO16IS_XL_ODR_AT_3333Hz_HP =       0x9,
  LSM6DSO16IS_XL_ODR_AT_6667Hz_HP =       0xa,
  LSM6DSO16IS_XL_ODR_AT_12Hz5_LP =        0x11,
  LSM6DSO16IS_XL_ODR_AT_26H_LP =          0x12,
  LSM6DSO16IS_XL_ODR_AT_52Hz_LP =         0x13,
  LSM6DSO16IS_XL_ODR_AT_104Hz_LP =        0x14,
  LSM6DSO16IS_XL_ODR_AT_208Hz_LP =        0x15,
  LSM6DSO16IS_XL_ODR_AT_416Hz_LP =        0x16,
  LSM6DSO16IS_XL_ODR_AT_833Hz_LP =        0x17,
  LSM6DSO16IS_XL_ODR_AT_1667Hz_LP =       0x18,
  LSM6DSO16IS_XL_ODR_AT_3333Hz_LP =       0x19,
  LSM6DSO16IS_XL_ODR_AT_6667Hz_LP =       0x1a,
  LSM6DSO16IS_XL_ODR_AT_1Hz6_LP =         0x1b,
} lsm6dso16is_xl_data_rate_t;
int32_t lsm6dso16is_xl_data_rate_set(lsm6dso16is_ctx_t *ctx,
                                     lsm6dso16is_xl_data_rate_t val);
int32_t lsm6dso16is_xl_data_rate_get(lsm6dso16is_ctx_t *ctx,
                                     lsm6dso16is_xl_data_rate_t *val);

typedef enum {
  LSM6DSO16IS_250dps =                    0x0,
  LSM6DSO16IS_500dps =                    0x1,
  LSM6DSO16IS_1000dps =                   0x2,
  LSM6DSO16IS_2000dps =                   0x3,
  LSM6DSO16IS_125dps =                    0x10,
} lsm6dso16is_gy_full_scale_t;
int32_t lsm6dso16is_gy_full_scale_set(lsm6dso16is_ctx_t *ctx,
                                      lsm6dso16is_gy_full_scale_t val);
int32_t lsm6dso16is_gy_full_scale_get(lsm6dso16is_ctx_t *ctx,
                                      lsm6dso16is_gy_full_scale_t *val);

typedef enum {
  LSM6DSO16IS_GY_ODR_OFF =                0x0,
  LSM6DSO16IS_GY_ODR_AT_12Hz5_HP =        0x1,
  LSM6DSO16IS_GY_ODR_AT_26H_HP =          0x2,
  LSM6DSO16IS_GY_ODR_AT_52Hz_HP =         0x3,
  LSM6DSO16IS_GY_ODR_AT_104Hz_HP =        0x4,
  LSM6DSO16IS_GY_ODR_AT_208Hz_HP =        0x5,
  LSM6DSO16IS_GY_ODR_AT_416Hz_HP =        0x6,
  LSM6DSO16IS_GY_ODR_AT_833Hz_HP =        0x7,
  LSM6DSO16IS_GY_ODR_AT_1667Hz_HP =       0x8,
  LSM6DSO16IS_GY_ODR_AT_3333Hz_HP =       0x9,
  LSM6DSO16IS_GY_ODR_AT_6667Hz_HP =       0xa,
  LSM6DSO16IS_GY_ODR_AT_12Hz5_LP =        0x11,
  LSM6DSO16IS_GY_ODR_AT_26H_LP =          0x12,
  LSM6DSO16IS_GY_ODR_AT_52Hz_LP =         0x13,
  LSM6DSO16IS_GY_ODR_AT_104Hz_LP =        0x14,
  LSM6DSO16IS_GY_ODR_AT_208Hz_LP =        0x15,
  LSM6DSO16IS_GY_ODR_AT_416Hz_LP =        0x16,
  LSM6DSO16IS_GY_ODR_AT_833Hz_LP =        0x17,
  LSM6DSO16IS_GY_ODR_AT_1667Hz_LP =       0x18,
  LSM6DSO16IS_GY_ODR_AT_3333Hz_LP =       0x19,
  LSM6DSO16IS_GY_ODR_AT_6667Hz_LP =       0x1a,
} lsm6dso16is_gy_data_rate_t;
int32_t lsm6dso16is_gy_data_rate_set(lsm6dso16is_ctx_t *ctx,
                                     lsm6dso16is_gy_data_rate_t val);
int32_t lsm6dso16is_gy_data_rate_get(lsm6dso16is_ctx_t *ctx,
                                     lsm6dso16is_gy_data_rate_t *val);

int32_t lsm6dso16is_auto_increment_set(lsm6dso16is_ctx_t *ctx, uint8_t val);
int32_t lsm6dso16is_auto_increment_get(lsm6dso16is_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso16is_block_data_update_set(lsm6dso16is_ctx_t *ctx, uint8_t val);
int32_t lsm6dso16is_block_data_update_get(lsm6dso16is_ctx_t *ctx, uint8_t *val);

