stm32duino/LSM6DSO16IS/src/lsm6dso16is_reg.h
typedef enum {
  LSM6DSO16IS_SLV_0 =                     0x0,
  LSM6DSO16IS_SLV_0_1 =                   0x1,
  LSM6DSO16IS_SLV_0_1_2 =                 0x2,
  LSM6DSO16IS_SLV_0_1_2_3 =               0x3,
} lsm6dso16is_sh_slave_connected_t;
int32_t lsm6dso16is_sh_slave_connected_set(lsm6dso16is_ctx_t *ctx,
                                           lsm6dso16is_sh_slave_connected_t val);
int32_t lsm6dso16is_sh_slave_connected_get(lsm6dso16is_ctx_t *ctx,
                                           lsm6dso16is_sh_slave_connected_t *val);

int32_t lsm6dso16is_sh_master_set(lsm6dso16is_ctx_t *ctx, uint8_t val);
int32_t lsm6dso16is_sh_master_get(lsm6dso16is_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso16is_sh_master_interface_pull_up_set(lsm6dso16is_ctx_t *ctx,
                                                    uint8_t val);
int32_t lsm6dso16is_sh_master_interface_pull_up_get(lsm6dso16is_ctx_t *ctx,
                                                    uint8_t *val);

int32_t lsm6dso16is_sh_pass_through_set(lsm6dso16is_ctx_t *ctx, uint8_t val);
int32_t lsm6dso16is_sh_pass_through_get(lsm6dso16is_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSO16IS_SH_TRG_XL_GY_DRDY =         0x0,
  LSM6DSO16IS_SH_TRIG_INT2 =              0x1,
} lsm6dso16is_sh_syncro_mode_t;
int32_t lsm6dso16is_sh_syncro_mode_set(lsm6dso16is_ctx_t *ctx,
                                       lsm6dso16is_sh_syncro_mode_t val);
int32_t lsm6dso16is_sh_syncro_mode_get(lsm6dso16is_ctx_t *ctx,
                                       lsm6dso16is_sh_syncro_mode_t *val);

typedef enum {
  LSM6DSO16IS_EACH_SH_CYCLE =             0x0,
  LSM6DSO16IS_ONLY_FIRST_CYCLE =          0x1,
} lsm6dso16is_sh_write_mode_t;
int32_t lsm6dso16is_sh_write_mode_set(lsm6dso16is_ctx_t *ctx,
                                      lsm6dso16is_sh_write_mode_t val);
int32_t lsm6dso16is_sh_write_mode_get(lsm6dso16is_ctx_t *ctx,
                                      lsm6dso16is_sh_write_mode_t *val);

int32_t lsm6dso16is_sh_reset_set(lsm6dso16is_ctx_t *ctx, uint8_t val);
int32_t lsm6dso16is_sh_reset_get(lsm6dso16is_ctx_t *ctx, uint8_t *val);

typedef struct {
  uint8_t   slv0_add;
  uint8_t   slv0_subadd;
  uint8_t   slv0_data;
} lsm6dso16is_sh_cfg_write_t;
int32_t lsm6dso16is_sh_cfg_write(lsm6dso16is_ctx_t *ctx,
                                 lsm6dso16is_sh_cfg_write_t *val);
typedef enum {
  LSM6DSO16IS_SH_104Hz =                  0x0,
  LSM6DSO16IS_SH_52Hz =                   0x1,
  LSM6DSO16IS_SH_26Hz =                   0x2,
  LSM6DSO16IS_SH_12_5Hz =                 0x3,
} lsm6dso16is_sh_data_rate_t;
int32_t lsm6dso16is_sh_data_rate_set(lsm6dso16is_ctx_t *ctx,
                                     lsm6dso16is_sh_data_rate_t val);
int32_t lsm6dso16is_sh_data_rate_get(lsm6dso16is_ctx_t *ctx,
                                     lsm6dso16is_sh_data_rate_t *val);

typedef struct {
  uint8_t   slv_add;
  uint8_t   slv_subadd;
  uint8_t   slv_len;
} lsm6dso16is_sh_cfg_read_t;
int32_t lsm6dso16is_sh_slv0_cfg_read(lsm6dso16is_ctx_t *ctx,
                                     lsm6dso16is_sh_cfg_read_t *val);
int32_t lsm6dso16is_sh_slv1_cfg_read(lsm6dso16is_ctx_t *ctx,
                                     lsm6dso16is_sh_cfg_read_t *val);
int32_t lsm6dso16is_sh_slv2_cfg_read(lsm6dso16is_ctx_t *ctx,
                                     lsm6dso16is_sh_cfg_read_t *val);
int32_t lsm6dso16is_sh_slv3_cfg_read(lsm6dso16is_ctx_t *ctx,
                                     lsm6dso16is_sh_cfg_read_t *val);

int32_t lsm6dso16is_ispu_reset_set(lsm6dso16is_ctx_t *ctx, uint8_t val);
int32_t lsm6dso16is_ispu_reset_get(lsm6dso16is_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSO16IS_ISPU_CLK_5MHz =             0x0,
  LSM6DSO16IS_ISPU_CLK_10MHz =            0x1,
} lsm6dso16is_ispu_clock_sel_t;
int32_t lsm6dso16is_ispu_clock_set(lsm6dso16is_ctx_t *ctx,
                                   lsm6dso16is_ispu_clock_sel_t val);
int32_t lsm6dso16is_ispu_clock_get(lsm6dso16is_ctx_t *ctx,
                                   lsm6dso16is_ispu_clock_sel_t *val);

typedef enum {
  LSM6DSO16IS_ISPU_ODR_OFF =              0x0,
  LSM6DSO16IS_ISPU_ODR_AT_12Hz5 =         0x1,
  LSM6DSO16IS_ISPU_ODR_AT_26Hz =          0x2,
  LSM6DSO16IS_ISPU_ODR_AT_52Hz =          0x3,
  LSM6DSO16IS_ISPU_ODR_AT_104Hz =         0x4,
  LSM6DSO16IS_ISPU_ODR_AT_208Hz =         0x5,
  LSM6DSO16IS_ISPU_ODR_AT_416Hz =         0x6,
  LSM6DSO16IS_ISPU_ODR_AT_833Hz =         0x7,
  LSM6DSO16IS_ISPU_ODR_AT_1667Hz =        0x8,
  LSM6DSO16IS_ISPU_ODR_AT_3333Hz =        0x9,
  LSM6DSO16IS_ISPU_ODR_AT_6667Hz =        0xa,
} lsm6dso16is_ispu_data_rate_t;
int32_t lsm6dso16is_ispu_data_rate_set(lsm6dso16is_ctx_t *ctx,
                                       lsm6dso16is_ispu_data_rate_t val);
int32_t lsm6dso16is_ispu_data_rate_get(lsm6dso16is_ctx_t *ctx,
                                       lsm6dso16is_ispu_data_rate_t *val);

typedef enum {
  LSM6DSO16IS_ISPU_BDU_OFF =              0x0,
  LSM6DSO16IS_ISPU_BDU_ON_2B_4B =         0x1,
  LSM6DSO16IS_ISPU_BDU_ON_2B_2B =         0x2,
  LSM6DSO16IS_ISPU_BDU_ON_4B_4B =         0x3,
} lsm6dso16is_ispu_bdu_t;
int32_t lsm6dso16is_ispu_bdu_set(lsm6dso16is_ctx_t *ctx, lsm6dso16is_ispu_bdu_t val);
int32_t lsm6dso16is_ispu_bdu_get(lsm6dso16is_ctx_t *ctx,
                                 lsm6dso16is_ispu_bdu_t *val);

int32_t lsm6dso16is_ia_ispu_get(lsm6dso16is_ctx_t *ctx, uint32_t *val);

int32_t lsm6dso16is_ispu_write_dummy_cfg(lsm6dso16is_ctx_t *ctx, uint8_t offset,
                                         uint8_t *val, uint8_t len);
int32_t lsm6dso16is_ispu_ready_dummy_cfg(lsm6dso16is_ctx_t *ctx, uint8_t offset,
                                         uint8_t *val, uint8_t len);

typedef enum {
  LSM6DSO16IS_ISPU_TURN_ON =              0x0,
  LSM6DSO16IS_ISPU_TURN_OFF =             0x1,
} lsm6dso16is_ispu_boot_latched_t;
int32_t lsm6dso16is_ispu_boot_set(lsm6dso16is_ctx_t *ctx,
                                  lsm6dso16is_ispu_boot_latched_t val);
int32_t lsm6dso16is_ispu_boot_get(lsm6dso16is_ctx_t *ctx,
                                  lsm6dso16is_ispu_boot_latched_t *val);

